{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "ShNLBi1-_2Se"
   },
   "source": [
    "# Querying the Guide to Pharmacology Database\n",
    "\n",
    "---\n",
    "This notebook initializes and works with the Guide to Pharmacology Database using Neo4j and Cypher.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "ugWh9WTCASLv"
   },
   "source": [
    "## Setup and Data Loading\n",
    "\n",
    "First, let's review the setup and ensure all necessary dependencies are installed."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Installing Required Libraries\n",
    "\n",
    "This cell installs the `rdflib-neo4j` and `openpyxl` libraries, which are necessary for RDF graph handling and working with Excel files, respectively."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "hIdweyPbkPnH",
    "outputId": "b9ab718f-4a64-4f81-8605-bd48303b0671"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m A new release of pip is available: \u001b[0m\u001b[31;49m24.0\u001b[0m\u001b[39;49m -> \u001b[0m\u001b[32;49m24.3.1\u001b[0m\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m To update, run: \u001b[0m\u001b[32;49mpip install --upgrade pip\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "%pip install -q neo4j openpyxl"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pathlib import Path\n",
    "\n",
    "# Define configuration constants\n",
    "INTERIM_DIR = Path(\"../data/interim\")  # Standardize path using pathlib"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Setting up Database Connection\n",
    "\n",
    "Here, we configure the connection to the Neo4j database by using environment variables for secure access. Ensure the required environment variables (`NEO4J_LCL_URI`, `NEO4J_USERNAME`, and `NEO4J_LCL_PASSWORD`) are set before proceeding."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "id": "XyQu2-_IkOh9"
   },
   "outputs": [],
   "source": [
    "import os\n",
    "\n",
    "NEO_DB_URI = os.getenv('NEO4J_URI')\n",
    "NEO_DB_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO_DB_PWD = os.getenv('NEO4J_PASSWORD')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NEO_DB_URI: neo4j+s://715e278f.databases.neo4j.io\n"
     ]
    }
   ],
   "source": [
    "print(f'NEO_DB_URI: {NEO_DB_URI}')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "zc_PvQad_Lzs"
   },
   "source": [
    "## Querying the Guide to Pharmacology Data\n",
    "\n",
    "This section demonstrates how to query the database to explore the Guide to Pharmacology (GtoP) dataset using Cypher.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Initializing Neo4j Driver\n",
    "\n",
    "This cell initializes the Neo4j `GraphDatabase` driver for establishing a connection to the database. Ensure the credentials and URI are correctly configured for successful interaction.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "id": "cx7CAGZN5yBN"
   },
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Initialize Neo4j driver\n",
    "driver = GraphDatabase.driver(\n",
    "    NEO_DB_URI,\n",
    "    auth=(NEO_DB_USERNAME, NEO_DB_PWD)\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Setup Reused Functions\n",
    "\n",
    "This section introduces reusable helper functions to streamline querying and interacting with the Neo4j database.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_cypher_query(query):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        result = session.run(query)\n",
    "        # Fetch all results and convert them into a list of dictionaries\n",
    "        return [record.data() for record in result]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying for a list of drug compounds"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_query = \"\"\"\n",
    "MATCH (l:Resource)\n",
    "WHERE l.ligandName IN ['RGFP966', 'belinostat', 'ricolinostat', 'nexturastat A', 'pyroxamide', 'entinostat', 'resminostat', 'panobinostat', 'R306465', 'M 344', 'AR-42']\n",
    "MATCH path = (l)-[:hasLigand]-(i)-[:hasTarget]-(t)-[:hasTargetFamily]-(tf)\n",
    "    OPTIONAL MATCH (i)-[:hasAction]-(a)\n",
    "    OPTIONAL MATCH (i)-[:hasAffinity]-(af)\n",
    "    OPTIONAL MATCH (i)-[:hasReference]-(r)\n",
    "    OPTIONAL MATCH (l)-[:xref]-(xr)\n",
    "RETURN path, a, af, r\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#NoAction'},\n",
      "  'af': {'hasMedianValue': 8.0,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity88388'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction88388'},\n",
      "           'hasTarget',\n",
      "           {'label': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'nomenclature': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target3072'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': 'Chromatin modifying enzymes (<i>Plasmodium</i> spp.)',\n",
      "            'targetFamilyName': 'Chromatin modifying enzymes '\n",
      "                                '(<i>Plasmodium</i> spp.)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily1059'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/26199860'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#NoAction'},\n",
      "  'af': {'hasMedianValue': 8.050000190734863,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity88389'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction88389'},\n",
      "           'hasTarget',\n",
      "           {'label': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'nomenclature': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target3072'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': 'Chromatin modifying enzymes (<i>Plasmodium</i> spp.)',\n",
      "            'targetFamilyName': 'Chromatin modifying enzymes '\n",
      "                                '(<i>Plasmodium</i> spp.)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily1059'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/28107750'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#NoAction'},\n",
      "  'af': {'hasMedianValue': 7.519999980926514,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity88418'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction88418'},\n",
      "           'hasTarget',\n",
      "           {'label': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'nomenclature': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target3072'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': 'Chromatin modifying enzymes (<i>Plasmodium</i> spp.)',\n",
      "            'targetFamilyName': 'Chromatin modifying enzymes '\n",
      "                                '(<i>Plasmodium</i> spp.)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily1059'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/26199860'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#NoAction'},\n",
      "  'af': {'hasMedianValue': 6.03000020980835,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity88419'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction88419'},\n",
      "           'hasTarget',\n",
      "           {'label': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'nomenclature': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target3072'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': 'Chromatin modifying enzymes (<i>Plasmodium</i> spp.)',\n",
      "            'targetFamilyName': 'Chromatin modifying enzymes '\n",
      "                                '(<i>Plasmodium</i> spp.)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily1059'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/24434750'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#NoAction'},\n",
      "  'af': {'hasMedianValue': 6.929999828338623,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity88420'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction88420'},\n",
      "           'hasTarget',\n",
      "           {'label': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'nomenclature': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target3072'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': 'Chromatin modifying enzymes (<i>Plasmodium</i> spp.)',\n",
      "            'targetFamilyName': 'Chromatin modifying enzymes '\n",
      "                                '(<i>Plasmodium</i> spp.)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily1059'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/24434750'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#NoAction'},\n",
      "  'af': {'hasMedianValue': 6.829999923706055,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity88421'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction88421'},\n",
      "           'hasTarget',\n",
      "           {'label': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'nomenclature': 'Plasmodium falciparum histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target3072'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': 'Chromatin modifying enzymes (<i>Plasmodium</i> spp.)',\n",
      "            'targetFamilyName': 'Chromatin modifying enzymes '\n",
      "                                '(<i>Plasmodium</i> spp.)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily1059'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/24434750'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.610000133514404,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79806'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79806'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 8',\n",
      "            'nomenclature': 'histone deacetylase 8',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2619'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.059999942779541,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79873'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccn(c1)S(=O)(=O)c1ccc(cc1)CN(C)C',\n",
      "            'comment': 'Resminostat is an HDAC inhibitor with selectivity for '\n",
      "                       'HDACs 1, 3 and 6, with significantly lower affinity '\n",
      "                       'for HDAC8 <Reference id=24592/>.',\n",
      "            'inChI': 'InChI=1S/C16H19N3O4S/c1-18(2)11-13-3-6-15(7-4-13)24(22,23)19-10-9-14(12-19)5-8-16(20)17-21/h3-10,12,21H,11H2,1-2H3,(H,17,20)/b8-5+',\n",
      "            'inChIKey': 'FECGNJPYVFEKOD-VMPITWQZSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccn(c1)S(=O)(=O)c1ccc(cc1)CN(C)C',\n",
      "            'iupacName': '(E)-3-[1-[4-(dimethylaminomethyl)phenyl]sulfonylpyrrol-3-yl]-N-hydroxyprop-2-enamide',\n",
      "            'label': 'resminostat',\n",
      "            'ligandName': 'resminostat',\n",
      "            'synonym': 'BYK408740',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7502'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79873'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 8',\n",
      "            'nomenclature': 'histone deacetylase 8',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2619'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20201941'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.0,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79309'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'comment': 'Rocilinostat is an investigational HDAC6 inhibitor '\n",
      "                       '<Reference id=24127/>. But note that it exhibits only '\n",
      "                       '~10-fold enzymic selectivity against the class I '\n",
      "                       'isoform, HDAC1.',\n",
      "            'inChI': 'InChI=1S/C24H27N5O3/c30-22(28-32)15-9-1-2-10-16-25-23(31)19-17-26-24(27-18-19)29(20-11-5-3-6-12-20)21-13-7-4-8-14-21/h3-8,11-14,17-18,32H,1-2,9-10,15-16H2,(H,25,31)(H,28,30)',\n",
      "            'inChIKey': 'QGZYDVAGYRLSKP-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'iupacName': 'N-[7-(hydroxyamino)-7-oxoheptyl]-2-(N-phenylanilino)pyrimidine-5-carboxamide',\n",
      "            'label': 'ricolinostat',\n",
      "            'ligandName': 'ricolinostat',\n",
      "            'synonym': 'ACY-1215',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7010'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79309'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 8',\n",
      "            'nomenclature': 'histone deacetylase 8',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2619'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/22262760'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.670000076293945,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79840'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79840'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 8',\n",
      "            'nomenclature': 'histone deacetylase 8',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2619'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.599999904632568,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79849'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79849'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 8',\n",
      "            'nomenclature': 'histone deacetylase 8',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2619'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.440000057220459,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79151'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'comment': 'Entinostat (MS-275) inhibits Class I histone '\n",
      "                       'deacetylases (HDACs 1, 2, 3 & 8), but has been shown '\n",
      "                       'to be somewhat selective for HDAC1 <Reference '\n",
      "                       'id=23898/><Reference id=23750/>. Studies in rodent '\n",
      "                       'models of inflammation suggest that inhibition by '\n",
      "                       'entinostat may be clinically useful <Reference '\n",
      "                       'id=23899/><Reference id=23900/><Reference '\n",
      "                       'id=23901/><Reference id=23902/>, perhaps more so than '\n",
      "                       'broader acting Class I HDAC inhibitors such as '\n",
      "                       'vorinostat (SAHA) <Reference id=23902/>.',\n",
      "            'inChI': 'InChI=1S/C21H20N4O3/c22-18-5-1-2-6-19(18)25-20(26)17-9-7-15(8-10-17)13-24-21(27)28-14-16-4-3-11-23-12-16/h1-12H,13-14,22H2,(H,24,27)(H,25,26)',\n",
      "            'inChIKey': 'INVTYAOGFAGBOE-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'iupacName': 'pyridin-3-ylmethyl '\n",
      "                         'N-({4-[(2-aminophenyl)carbamoyl]phenyl}methyl)carbamate',\n",
      "            'label': 'entinostat',\n",
      "            'ligandName': 'entinostat',\n",
      "            'synonym': 'SNDX-275',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7007'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79151'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 3',\n",
      "            'nomenclature': 'histone deacetylase 3',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2617'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.289999961853027,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79308'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'comment': 'Rocilinostat is an investigational HDAC6 inhibitor '\n",
      "                       '<Reference id=24127/>. But note that it exhibits only '\n",
      "                       '~10-fold enzymic selectivity against the class I '\n",
      "                       'isoform, HDAC1.',\n",
      "            'inChI': 'InChI=1S/C24H27N5O3/c30-22(28-32)15-9-1-2-10-16-25-23(31)19-17-26-24(27-18-19)29(20-11-5-3-6-12-20)21-13-7-4-8-14-21/h3-8,11-14,17-18,32H,1-2,9-10,15-16H2,(H,25,31)(H,28,30)',\n",
      "            'inChIKey': 'QGZYDVAGYRLSKP-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'iupacName': 'N-[7-(hydroxyamino)-7-oxoheptyl]-2-(N-phenylanilino)pyrimidine-5-carboxamide',\n",
      "            'label': 'ricolinostat',\n",
      "            'ligandName': 'ricolinostat',\n",
      "            'synonym': 'ACY-1215',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7010'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79308'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 3',\n",
      "            'nomenclature': 'histone deacetylase 3',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2617'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/22262760'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 8.399999618530273,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79802'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79802'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 3',\n",
      "            'nomenclature': 'histone deacetylase 3',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2617'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 5.639999866485596,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79855'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'comment': 'Entinostat (MS-275) inhibits Class I histone '\n",
      "                       'deacetylases (HDACs 1, 2, 3 & 8), but has been shown '\n",
      "                       'to be somewhat selective for HDAC1 <Reference '\n",
      "                       'id=23898/><Reference id=23750/>. Studies in rodent '\n",
      "                       'models of inflammation suggest that inhibition by '\n",
      "                       'entinostat may be clinically useful <Reference '\n",
      "                       'id=23899/><Reference id=23900/><Reference '\n",
      "                       'id=23901/><Reference id=23902/>, perhaps more so than '\n",
      "                       'broader acting Class I HDAC inhibitors such as '\n",
      "                       'vorinostat (SAHA) <Reference id=23902/>.',\n",
      "            'inChI': 'InChI=1S/C21H20N4O3/c22-18-5-1-2-6-19(18)25-20(26)17-9-7-15(8-10-17)13-24-21(27)28-14-16-4-3-11-23-12-16/h1-12H,13-14,22H2,(H,24,27)(H,25,26)',\n",
      "            'inChIKey': 'INVTYAOGFAGBOE-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'iupacName': 'pyridin-3-ylmethyl '\n",
      "                         'N-({4-[(2-aminophenyl)carbamoyl]phenyl}methyl)carbamate',\n",
      "            'label': 'entinostat',\n",
      "            'ligandName': 'entinostat',\n",
      "            'synonym': 'SNDX-275',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7007'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79855'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 3',\n",
      "            'nomenclature': 'histone deacetylase 3',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2617'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 8.819999694824219,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79844'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79844'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 3',\n",
      "            'nomenclature': 'histone deacetylase 3',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2617'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.300000190734863,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79871'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccn(c1)S(=O)(=O)c1ccc(cc1)CN(C)C',\n",
      "            'comment': 'Resminostat is an HDAC inhibitor with selectivity for '\n",
      "                       'HDACs 1, 3 and 6, with significantly lower affinity '\n",
      "                       'for HDAC8 <Reference id=24592/>.',\n",
      "            'inChI': 'InChI=1S/C16H19N3O4S/c1-18(2)11-13-3-6-15(7-4-13)24(22,23)19-10-9-14(12-19)5-8-16(20)17-21/h3-10,12,21H,11H2,1-2H3,(H,17,20)/b8-5+',\n",
      "            'inChIKey': 'FECGNJPYVFEKOD-VMPITWQZSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccn(c1)S(=O)(=O)c1ccc(cc1)CN(C)C',\n",
      "            'iupacName': '(E)-3-[1-[4-(dimethylaminomethyl)phenyl]sulfonylpyrrol-3-yl]-N-hydroxyprop-2-enamide',\n",
      "            'label': 'resminostat',\n",
      "            'ligandName': 'resminostat',\n",
      "            'synonym': 'BYK408740',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7502'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79871'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 3',\n",
      "            'nomenclature': 'histone deacetylase 3',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2617'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20201941'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.099999904632568,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79868'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'O=C(Nc1ccc(cc1N)F)C=Cc1cnn(c1)CC=Cc1ccccc1',\n",
      "            'comment': 'RGFP966 is a selective inhibitor of histone '\n",
      "                       'deacetylase 3 (HDAC3) <Reference id=24589/>. In rodent '\n",
      "                       'studies, RGFP966-induced inhibition of HDAC3 appears '\n",
      "                       'to enhance memory processes involved in extinction of '\n",
      "                       'drug-seeking behaviour <Reference id=24589/>.',\n",
      "            'inChI': 'InChI=1S/C21H19FN4O/c22-18-9-10-20(19(23)13-18)25-21(27)11-8-17-14-24-26(15-17)12-4-7-16-5-2-1-3-6-16/h1-11,13-15H,12,23H2,(H,25,27)/b7-4+,11-8+',\n",
      "            'inChIKey': 'BLVQHYHDYFTPDV-VCABWLAWSA-N',\n",
      "            'isomericSMILES': 'O=C(Nc1ccc(cc1N)F)/C=C/c1cnn(c1)C/C=C/c1ccccc1',\n",
      "            'iupacName': '(2E)-N-(2-amino-4-fluorophenyl)-3-{1-[(2E)-3-phenylprop-2-en-1-yl]-1H-pyrazol-4-yl}prop-2-enamide',\n",
      "            'label': 'RGFP966',\n",
      "            'ligandName': 'RGFP966',\n",
      "            'synonym': 'RGFP-966',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7500'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79868'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 3',\n",
      "            'nomenclature': 'histone deacetylase 3',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2617'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/23297220'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.519999980926514,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity80048'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction80048'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 3',\n",
      "            'nomenclature': 'histone deacetylase 3',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2617'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.190000057220459,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79148'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'comment': 'Entinostat (MS-275) inhibits Class I histone '\n",
      "                       'deacetylases (HDACs 1, 2, 3 & 8), but has been shown '\n",
      "                       'to be somewhat selective for HDAC1 <Reference '\n",
      "                       'id=23898/><Reference id=23750/>. Studies in rodent '\n",
      "                       'models of inflammation suggest that inhibition by '\n",
      "                       'entinostat may be clinically useful <Reference '\n",
      "                       'id=23899/><Reference id=23900/><Reference '\n",
      "                       'id=23901/><Reference id=23902/>, perhaps more so than '\n",
      "                       'broader acting Class I HDAC inhibitors such as '\n",
      "                       'vorinostat (SAHA) <Reference id=23902/>.',\n",
      "            'inChI': 'InChI=1S/C21H20N4O3/c22-18-5-1-2-6-19(18)25-20(26)17-9-7-15(8-10-17)13-24-21(27)28-14-16-4-3-11-23-12-16/h1-12H,13-14,22H2,(H,24,27)(H,25,26)',\n",
      "            'inChIKey': 'INVTYAOGFAGBOE-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'iupacName': 'pyridin-3-ylmethyl '\n",
      "                         'N-({4-[(2-aminophenyl)carbamoyl]phenyl}methyl)carbamate',\n",
      "            'label': 'entinostat',\n",
      "            'ligandName': 'entinostat',\n",
      "            'synonym': 'SNDX-275',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7007'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79148'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 2',\n",
      "            'nomenclature': 'histone deacetylase 2',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2616'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.320000171661377,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79307'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'comment': 'Rocilinostat is an investigational HDAC6 inhibitor '\n",
      "                       '<Reference id=24127/>. But note that it exhibits only '\n",
      "                       '~10-fold enzymic selectivity against the class I '\n",
      "                       'isoform, HDAC1.',\n",
      "            'inChI': 'InChI=1S/C24H27N5O3/c30-22(28-32)15-9-1-2-10-16-25-23(31)19-17-26-24(27-18-19)29(20-11-5-3-6-12-20)21-13-7-4-8-14-21/h3-8,11-14,17-18,32H,1-2,9-10,15-16H2,(H,25,31)(H,28,30)',\n",
      "            'inChIKey': 'QGZYDVAGYRLSKP-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'iupacName': 'N-[7-(hydroxyamino)-7-oxoheptyl]-2-(N-phenylanilino)pyrimidine-5-carboxamide',\n",
      "            'label': 'ricolinostat',\n",
      "            'ligandName': 'ricolinostat',\n",
      "            'synonym': 'ACY-1215',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7010'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79307'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 2',\n",
      "            'nomenclature': 'histone deacetylase 2',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2616'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/22262760'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 8.520000457763672,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79801'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79801'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 2',\n",
      "            'nomenclature': 'histone deacetylase 2',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2616'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 5.940000057220459,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79854'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'comment': 'Entinostat (MS-275) inhibits Class I histone '\n",
      "                       'deacetylases (HDACs 1, 2, 3 & 8), but has been shown '\n",
      "                       'to be somewhat selective for HDAC1 <Reference '\n",
      "                       'id=23898/><Reference id=23750/>. Studies in rodent '\n",
      "                       'models of inflammation suggest that inhibition by '\n",
      "                       'entinostat may be clinically useful <Reference '\n",
      "                       'id=23899/><Reference id=23900/><Reference '\n",
      "                       'id=23901/><Reference id=23902/>, perhaps more so than '\n",
      "                       'broader acting Class I HDAC inhibitors such as '\n",
      "                       'vorinostat (SAHA) <Reference id=23902/>.',\n",
      "            'inChI': 'InChI=1S/C21H20N4O3/c22-18-5-1-2-6-19(18)25-20(26)17-9-7-15(8-10-17)13-24-21(27)28-14-16-4-3-11-23-12-16/h1-12H,13-14,22H2,(H,24,27)(H,25,26)',\n",
      "            'inChIKey': 'INVTYAOGFAGBOE-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'iupacName': 'pyridin-3-ylmethyl '\n",
      "                         'N-({4-[(2-aminophenyl)carbamoyl]phenyl}methyl)carbamate',\n",
      "            'label': 'entinostat',\n",
      "            'ligandName': 'entinostat',\n",
      "            'synonym': 'SNDX-275',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7007'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79854'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 2',\n",
      "            'nomenclature': 'histone deacetylase 2',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2616'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.900000095367432,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79835'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79835'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 2',\n",
      "            'nomenclature': 'histone deacetylase 2',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2616'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 9.069999694824219,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79843'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79843'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 2',\n",
      "            'nomenclature': 'histone deacetylase 2',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2616'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 8.520000457763672,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79807'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79807'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 9',\n",
      "            'nomenclature': 'histone deacetylase 9',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2620'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.889999866485596,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79841'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79841'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 9',\n",
      "            'nomenclature': 'histone deacetylase 9',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2620'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.599999904632568,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79850'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79850'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 9',\n",
      "            'nomenclature': 'histone deacetylase 9',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2620'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.300000190734863,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79856'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'comment': 'Entinostat (MS-275) inhibits Class I histone '\n",
      "                       'deacetylases (HDACs 1, 2, 3 & 8), but has been shown '\n",
      "                       'to be somewhat selective for HDAC1 <Reference '\n",
      "                       'id=23898/><Reference id=23750/>. Studies in rodent '\n",
      "                       'models of inflammation suggest that inhibition by '\n",
      "                       'entinostat may be clinically useful <Reference '\n",
      "                       'id=23899/><Reference id=23900/><Reference '\n",
      "                       'id=23901/><Reference id=23902/>, perhaps more so than '\n",
      "                       'broader acting Class I HDAC inhibitors such as '\n",
      "                       'vorinostat (SAHA) <Reference id=23902/>.',\n",
      "            'inChI': 'InChI=1S/C21H20N4O3/c22-18-5-1-2-6-19(18)25-20(26)17-9-7-15(8-10-17)13-24-21(27)28-14-16-4-3-11-23-12-16/h1-12H,13-14,22H2,(H,24,27)(H,25,26)',\n",
      "            'inChIKey': 'INVTYAOGFAGBOE-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'iupacName': 'pyridin-3-ylmethyl '\n",
      "                         'N-({4-[(2-aminophenyl)carbamoyl]phenyl}methyl)carbamate',\n",
      "            'label': 'entinostat',\n",
      "            'ligandName': 'entinostat',\n",
      "            'synonym': 'SNDX-275',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7007'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79856'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 9',\n",
      "            'nomenclature': 'histone deacetylase 9',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2620'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.210000038146973,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79804'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79804'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 6',\n",
      "            'nomenclature': 'histone deacetylase 6',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2618'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 9.300000190734863,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity87533'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'CCCCN(C(=O)Nc1ccccc1)Cc1ccc(cc1)C(=O)NO',\n",
      "            'comment': 'Nexturastat A is a potent and selective HDAC6 '\n",
      "                       'inhibitor <Reference id=24597/>.',\n",
      "            'inChI': 'InChI=1S/C19H23N3O3/c1-2-3-13-22(19(24)20-17-7-5-4-6-8-17)14-15-9-11-16(12-10-15)18(23)21-25/h4-12,25H,2-3,13-14H2,1H3,(H,20,24)(H,21,23)',\n",
      "            'inChIKey': 'JZWXMCPARMXZQV-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'CCCCN(C(=O)Nc1ccccc1)Cc1ccc(cc1)C(=O)NO',\n",
      "            'iupacName': '4-{[butyl(phenylcarbamoyl)amino]methyl}-N-hydroxybenzamide',\n",
      "            'label': 'nexturastat A',\n",
      "            'ligandName': 'nexturastat A',\n",
      "            'synonym': 'S7473',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7504'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction87533'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 6',\n",
      "            'nomenclature': 'histone deacetylase 6',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2618'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/32815366'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 8.329999923706055,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79310'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'comment': 'Rocilinostat is an investigational HDAC6 inhibitor '\n",
      "                       '<Reference id=24127/>. But note that it exhibits only '\n",
      "                       '~10-fold enzymic selectivity against the class I '\n",
      "                       'isoform, HDAC1.',\n",
      "            'inChI': 'InChI=1S/C24H27N5O3/c30-22(28-32)15-9-1-2-10-16-25-23(31)19-17-26-24(27-18-19)29(20-11-5-3-6-12-20)21-13-7-4-8-14-21/h3-8,11-14,17-18,32H,1-2,9-10,15-16H2,(H,25,31)(H,28,30)',\n",
      "            'inChIKey': 'QGZYDVAGYRLSKP-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'iupacName': 'N-[7-(hydroxyamino)-7-oxoheptyl]-2-(N-phenylanilino)pyrimidine-5-carboxamide',\n",
      "            'label': 'ricolinostat',\n",
      "            'ligandName': 'ricolinostat',\n",
      "            'synonym': 'ACY-1215',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7010'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79310'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 6',\n",
      "            'nomenclature': 'histone deacetylase 6',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2618'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/22262760'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.090000152587891,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79838'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79838'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 6',\n",
      "            'nomenclature': 'histone deacetylase 6',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2618'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 8.800000190734863,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79847'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79847'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 6',\n",
      "            'nomenclature': 'histone deacetylase 6',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2618'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.139999866485596,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79872'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccn(c1)S(=O)(=O)c1ccc(cc1)CN(C)C',\n",
      "            'comment': 'Resminostat is an HDAC inhibitor with selectivity for '\n",
      "                       'HDACs 1, 3 and 6, with significantly lower affinity '\n",
      "                       'for HDAC8 <Reference id=24592/>.',\n",
      "            'inChI': 'InChI=1S/C16H19N3O4S/c1-18(2)11-13-3-6-15(7-4-13)24(22,23)19-10-9-14(12-19)5-8-16(20)17-21/h3-10,12,21H,11H2,1-2H3,(H,17,20)/b8-5+',\n",
      "            'inChIKey': 'FECGNJPYVFEKOD-VMPITWQZSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccn(c1)S(=O)(=O)c1ccc(cc1)CN(C)C',\n",
      "            'iupacName': '(E)-3-[1-[4-(dimethylaminomethyl)phenyl]sulfonylpyrrol-3-yl]-N-hydroxyprop-2-enamide',\n",
      "            'label': 'resminostat',\n",
      "            'ligandName': 'resminostat',\n",
      "            'synonym': 'BYK408740',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7502'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79872'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 6',\n",
      "            'nomenclature': 'histone deacetylase 6',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2618'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20201941'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 8.300000190734863,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79886'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'CCCCN(C(=O)Nc1ccccc1)Cc1ccc(cc1)C(=O)NO',\n",
      "            'comment': 'Nexturastat A is a potent and selective HDAC6 '\n",
      "                       'inhibitor <Reference id=24597/>.',\n",
      "            'inChI': 'InChI=1S/C19H23N3O3/c1-2-3-13-22(19(24)20-17-7-5-4-6-8-17)14-15-9-11-16(12-10-15)18(23)21-25/h4-12,25H,2-3,13-14H2,1H3,(H,20,24)(H,21,23)',\n",
      "            'inChIKey': 'JZWXMCPARMXZQV-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'CCCCN(C(=O)Nc1ccccc1)Cc1ccc(cc1)C(=O)NO',\n",
      "            'iupacName': '4-{[butyl(phenylcarbamoyl)amino]methyl}-N-hydroxybenzamide',\n",
      "            'label': 'nexturastat A',\n",
      "            'ligandName': 'nexturastat A',\n",
      "            'synonym': 'S7473',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7504'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79886'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 6',\n",
      "            'nomenclature': 'histone deacetylase 6',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2618'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/23009203'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.659999847412109,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79144'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'comment': 'Entinostat (MS-275) inhibits Class I histone '\n",
      "                       'deacetylases (HDACs 1, 2, 3 & 8), but has been shown '\n",
      "                       'to be somewhat selective for HDAC1 <Reference '\n",
      "                       'id=23898/><Reference id=23750/>. Studies in rodent '\n",
      "                       'models of inflammation suggest that inhibition by '\n",
      "                       'entinostat may be clinically useful <Reference '\n",
      "                       'id=23899/><Reference id=23900/><Reference '\n",
      "                       'id=23901/><Reference id=23902/>, perhaps more so than '\n",
      "                       'broader acting Class I HDAC inhibitors such as '\n",
      "                       'vorinostat (SAHA) <Reference id=23902/>.',\n",
      "            'inChI': 'InChI=1S/C21H20N4O3/c22-18-5-1-2-6-19(18)25-20(26)17-9-7-15(8-10-17)13-24-21(27)28-14-16-4-3-11-23-12-16/h1-12H,13-14,22H2,(H,24,27)(H,25,26)',\n",
      "            'inChIKey': 'INVTYAOGFAGBOE-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'iupacName': 'pyridin-3-ylmethyl '\n",
      "                         'N-({4-[(2-aminophenyl)carbamoyl]phenyl}methyl)carbamate',\n",
      "            'label': 'entinostat',\n",
      "            'ligandName': 'entinostat',\n",
      "            'synonym': 'SNDX-275',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7007'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79144'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 1',\n",
      "            'nomenclature': 'histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2658'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.239999771118164,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79306'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'comment': 'Rocilinostat is an investigational HDAC6 inhibitor '\n",
      "                       '<Reference id=24127/>. But note that it exhibits only '\n",
      "                       '~10-fold enzymic selectivity against the class I '\n",
      "                       'isoform, HDAC1.',\n",
      "            'inChI': 'InChI=1S/C24H27N5O3/c30-22(28-32)15-9-1-2-10-16-25-23(31)19-17-26-24(27-18-19)29(20-11-5-3-6-12-20)21-13-7-4-8-14-21/h3-8,11-14,17-18,32H,1-2,9-10,15-16H2,(H,25,31)(H,28,30)',\n",
      "            'inChIKey': 'QGZYDVAGYRLSKP-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)CCCCCCNC(=O)c1cnc(nc1)N(c1ccccc1)c1ccccc1',\n",
      "            'iupacName': 'N-[7-(hydroxyamino)-7-oxoheptyl]-2-(N-phenylanilino)pyrimidine-5-carboxamide',\n",
      "            'label': 'ricolinostat',\n",
      "            'ligandName': 'ricolinostat',\n",
      "            'synonym': 'ACY-1215',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7010'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79306'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 1',\n",
      "            'nomenclature': 'histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2658'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/22262760'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 8.520000457763672,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79800'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79800'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 1',\n",
      "            'nomenclature': 'histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2658'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.739999771118164,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79853'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'comment': 'Entinostat (MS-275) inhibits Class I histone '\n",
      "                       'deacetylases (HDACs 1, 2, 3 & 8), but has been shown '\n",
      "                       'to be somewhat selective for HDAC1 <Reference '\n",
      "                       'id=23898/><Reference id=23750/>. Studies in rodent '\n",
      "                       'models of inflammation suggest that inhibition by '\n",
      "                       'entinostat may be clinically useful <Reference '\n",
      "                       'id=23899/><Reference id=23900/><Reference '\n",
      "                       'id=23901/><Reference id=23902/>, perhaps more so than '\n",
      "                       'broader acting Class I HDAC inhibitors such as '\n",
      "                       'vorinostat (SAHA) <Reference id=23902/>.',\n",
      "            'inChI': 'InChI=1S/C21H20N4O3/c22-18-5-1-2-6-19(18)25-20(26)17-9-7-15(8-10-17)13-24-21(27)28-14-16-4-3-11-23-12-16/h1-12H,13-14,22H2,(H,24,27)(H,25,26)',\n",
      "            'inChIKey': 'INVTYAOGFAGBOE-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'O=C(OCc1cccnc1)NCc1ccc(cc1)C(=O)Nc1ccccc1N',\n",
      "            'iupacName': 'pyridin-3-ylmethyl '\n",
      "                         'N-({4-[(2-aminophenyl)carbamoyl]phenyl}methyl)carbamate',\n",
      "            'label': 'entinostat',\n",
      "            'ligandName': 'entinostat',\n",
      "            'synonym': 'SNDX-275',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7007'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79853'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 1',\n",
      "            'nomenclature': 'histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2658'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 5.519999980926514,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79885'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'CCCCN(C(=O)Nc1ccccc1)Cc1ccc(cc1)C(=O)NO',\n",
      "            'comment': 'Nexturastat A is a potent and selective HDAC6 '\n",
      "                       'inhibitor <Reference id=24597/>.',\n",
      "            'inChI': 'InChI=1S/C19H23N3O3/c1-2-3-13-22(19(24)20-17-7-5-4-6-8-17)14-15-9-11-16(12-10-15)18(23)21-25/h4-12,25H,2-3,13-14H2,1H3,(H,20,24)(H,21,23)',\n",
      "            'inChIKey': 'JZWXMCPARMXZQV-UHFFFAOYSA-N',\n",
      "            'isomericSMILES': 'CCCCN(C(=O)Nc1ccccc1)Cc1ccc(cc1)C(=O)NO',\n",
      "            'iupacName': '4-{[butyl(phenylcarbamoyl)amino]methyl}-N-hydroxybenzamide',\n",
      "            'label': 'nexturastat A',\n",
      "            'ligandName': 'nexturastat A',\n",
      "            'synonym': 'S7473',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7504'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79885'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 1',\n",
      "            'nomenclature': 'histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2658'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/23009203'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.389999866485596,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79834'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79834'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 1',\n",
      "            'nomenclature': 'histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2658'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 9.069999694824219,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79842'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79842'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 1',\n",
      "            'nomenclature': 'histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2658'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.369999885559082,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79870'},\n",
      "  'path': [{'approved': 'f',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccn(c1)S(=O)(=O)c1ccc(cc1)CN(C)C',\n",
      "            'comment': 'Resminostat is an HDAC inhibitor with selectivity for '\n",
      "                       'HDACs 1, 3 and 6, with significantly lower affinity '\n",
      "                       'for HDAC8 <Reference id=24592/>.',\n",
      "            'inChI': 'InChI=1S/C16H19N3O4S/c1-18(2)11-13-3-6-15(7-4-13)24(22,23)19-10-9-14(12-19)5-8-16(20)17-21/h3-10,12,21H,11H2,1-2H3,(H,17,20)/b8-5+',\n",
      "            'inChIKey': 'FECGNJPYVFEKOD-VMPITWQZSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccn(c1)S(=O)(=O)c1ccc(cc1)CN(C)C',\n",
      "            'iupacName': '(E)-3-[1-[4-(dimethylaminomethyl)phenyl]sulfonylpyrrol-3-yl]-N-hydroxyprop-2-enamide',\n",
      "            'label': 'resminostat',\n",
      "            'ligandName': 'resminostat',\n",
      "            'synonym': 'BYK408740',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7502'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79870'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 1',\n",
      "            'nomenclature': 'histone deacetylase 1',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2658'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20201941'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.920000076293945,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79803'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79803'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 4',\n",
      "            'nomenclature': 'histone deacetylase 4',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2659'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.940000057220459,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79837'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79837'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 4',\n",
      "            'nomenclature': 'histone deacetylase 4',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2659'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.420000076293945,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79845'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79845'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 4',\n",
      "            'nomenclature': 'histone deacetylase 4',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2659'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.849999904632568,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79805'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'comment': 'Panobinostat is a non-selective histone deacetylase '\n",
      "                       '(HDAC) inhibitor <Reference id=24577/><Reference '\n",
      "                       'id=24578/>. The compound also has antimalarial '\n",
      "                       'activity. <br><br>The <b>Malaria</b> tab on this '\n",
      "                       'ligand page provides additional curator comments of '\n",
      "                       'relevance to the Guide to MALARIA PHARMACOLOGY.',\n",
      "            'inChI': 'InChI=1S/C21H23N3O2/c1-15-18(19-4-2-3-5-20(19)23-15)12-13-22-14-17-8-6-16(7-9-17)10-11-21(25)24-26/h2-11,22-23,26H,12-14H2,1H3,(H,24,25)/b11-10+',\n",
      "            'inChIKey': 'FPOHNWQLNRZRFC-ZHACJKMWSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1ccc(cc1)CNCCc1c(C)[nH]c2c1cccc2',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[4-[[2-(2-methyl-1H-indol-3-yl)ethylamino]methyl]phenyl]prop-2-enamide',\n",
      "            'label': 'panobinostat',\n",
      "            'ligandName': 'panobinostat',\n",
      "            'synonym': 'LBH589',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7489'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79805'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 7',\n",
      "            'nomenclature': 'histone deacetylase 7',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2661'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.170000076293945,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79839'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79839'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 7',\n",
      "            'nomenclature': 'histone deacetylase 7',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2661'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/17868033'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 7.119999885559082,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79848'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79848'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 7',\n",
      "            'nomenclature': 'histone deacetylase 7',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2661'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}},\n",
      " {'a': {'uri': 'https://rdf.guidetopharmacology.org/ns/gtpo#InhibitionAction'},\n",
      "  'af': {'hasMedianValue': 6.760000228881836,\n",
      "         'uri': 'https://rdf.guidetopharmacology.org/GRAC/affinity79846'},\n",
      "  'path': [{'approved': 't',\n",
      "            'canonicalSMILES': 'ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'comment': 'Belinostat is a pan-histone deacetylase (HDAC) '\n",
      "                       'inhibitor <Reference id=24578/><Reference id=23750/>.',\n",
      "            'inChI': 'InChI=1S/C15H14N2O4S/c18-15(16-19)10-9-12-5-4-8-14(11-12)22(20,21)17-13-6-2-1-3-7-13/h1-11,17,19H,(H,16,18)/b10-9+',\n",
      "            'inChIKey': 'NCNRHFGMJRPRSK-MDZDMXLPSA-N',\n",
      "            'isomericSMILES': 'ONC(=O)/C=C/c1cccc(c1)S(=O)(=O)Nc1ccccc1',\n",
      "            'iupacName': '(E)-N-hydroxy-3-[3-(phenylsulfamoyl)phenyl]prop-2-enamide',\n",
      "            'label': 'belinostat',\n",
      "            'ligandName': 'belinostat',\n",
      "            'synonym': 'Beleodaq&reg;',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/ligand7496'},\n",
      "           'hasLigand',\n",
      "           {'uri': 'https://rdf.guidetopharmacology.org/GRAC/interaction79846'},\n",
      "           'hasTarget',\n",
      "           {'label': 'histone deacetylase 5',\n",
      "            'nomenclature': 'histone deacetylase 5',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/target2660'},\n",
      "           'hasTargetFamily',\n",
      "           {'label': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'targetFamilyName': '3.5.1.- Histone deacetylases (HDACs)',\n",
      "            'uri': 'https://rdf.guidetopharmacology.org/GRAC/targetFamily848'}],\n",
      "  'r': {'uri': 'http://identifiers.org/pubmed/20139990'}}]\n"
     ]
    }
   ],
   "source": [
    "from pprint import pprint\n",
    "\n",
    "results = run_cypher_query(cypher_query)\n",
    "\n",
    "pprint(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "export_query = f\"\"\"\n",
    "CALL apoc.export.graphml.query(\n",
    "    'MATCH (l:Resource)\n",
    "     WHERE l.ligandName IN [\"RGFP966\", \"belinostat\", \"ricolinostat\", \"nexturastat A\", \"pyroxamide\", \"entinostat\", \"resminostat\", \"panobinostat\", \"R306465\", \"M 344\", \"AR-42\"]\n",
    "     MATCH path = (l)-[:hasLigand]-(i)-[:hasTarget]-(t)-[:hasTargetFamily]-(tf)\n",
    "     OPTIONAL MATCH (i)-[:hasAction]-(a)\n",
    "     OPTIONAL MATCH (i)-[:hasAffinity]-(af)\n",
    "     OPTIONAL MATCH (i)-[:hasReference]-(r)\n",
    "     OPTIONAL MATCH (l)-[:xref]-(xr)\n",
    "     RETURN path, a, af, r',\n",
    "    null,\n",
    "    {{stream: true, useTypes: true}}\n",
    ")\n",
    "YIELD data\n",
    "RETURN data\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(export_query)\n",
    "    graphml_data = result.single()['data']\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Write the GraphML data to a file\n",
    "with open(f\"{INTERIM_DIR}/gtp_aurk_inhibitors.graphml\", 'w') as f:\n",
    "    f.write(graphml_data)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying for Lists of Compounds - Tabular Format\n",
    "\n",
    "This section begins querying the database for specific information, such as retrieving lists of compounds using Cypher.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_query_hdac = \"\"\"\n",
    "// HDAC Inhibitors\n",
    "MATCH (l:Resource)\n",
    "WHERE l.ligandName IN ['RGFP966', 'belinostat', 'ricolinostat', 'nexturastat A', 'pyroxamide', '5-nitroso-8-quinolinol', 'entinostat', 'resminostat', 'panobinostat', 'R306465', 'M 344', 'AR-42']\n",
    "MATCH path = (l)-[:hasLigand]-(i)-[:hasTarget]-(t)-[:hasTargetFamily]-(tf)\n",
    "    OPTIONAL MATCH (i)-[:hasAction]-(a)\n",
    "    OPTIONAL MATCH (i)-[:hasAffinity]-(af)\n",
    "    OPTIONAL MATCH (i)-[:hasReference]-(r)\n",
    "    OPTIONAL MATCH (l)-[:xref]-(xr)\n",
    "    OPTIONAL MATCH (af)-[:hasUnits]-(afu)\n",
    "RETURN \n",
    "    l.label as Compound,\n",
    "    l.approved as FDA_Approved,\n",
    "    t.label as Target,\n",
    "    tf.label as Target_Family,\n",
    "    a.uri as Action,\n",
    "    af.hasMedianValue as Affinity_Median,\n",
    "    af.hasLowValue as Affinity_Low,\n",
    "    af.hasHighValue as Affinity_High,\n",
    "    afu.uri as Affinity_Units,\n",
    "    r.uri as Reference,\n",
    "    l.comment as Description,\n",
    "    l.inChIKey as InChIKey,\n",
    "    l.canonicalSMILES as SMILES,\n",
    "    xr.uri as CHEMBL\n",
    "ORDER BY l.ligandName, t.nomenclature\n",
    "\"\"\"\n",
    "\n",
    "cypher_query_cdk = \"\"\"\n",
    "// CDK Inhibitors\n",
    "MATCH (l:Resource)\n",
    "WHERE l.ligandName IN ['indisulam', 'dinaciclib', 'flavopiridol', 'Bms-265246', 'AT7519', 'PHA-793887', 'riviciclib', 'R-547', '7-hydroxystaurosporine', 'zotiraciclib', 'Sns-032', 'AZD5438']\n",
    "MATCH path = (l)-[:hasLigand]-(i)-[:hasTarget]-(t)-[:hasTargetFamily]-(tf)\n",
    "    OPTIONAL MATCH (i)-[:hasAction]-(a)\n",
    "    OPTIONAL MATCH (i)-[:hasAffinity]-(af)\n",
    "    OPTIONAL MATCH (i)-[:hasReference]-(r)\n",
    "    OPTIONAL MATCH (l)-[:xref]-(xr)\n",
    "    OPTIONAL MATCH (af)-[:hasUnits]-(afu)\n",
    "RETURN \n",
    "    l.label as Compound,\n",
    "    l.approved as FDA_Approved,\n",
    "    t.label as Target,\n",
    "    tf.label as Target_Family,\n",
    "    a.uri as Action,\n",
    "    af.hasMedianValue as Affinity_Median,\n",
    "    af.hasLowValue as Affinity_Low,\n",
    "    af.hasHighValue as Affinity_High,\n",
    "    afu.uri as Affinity_Units,\n",
    "    r.uri as Reference,\n",
    "    l.comment as Description,\n",
    "    l.inChIKey as InChIKey,\n",
    "    l.canonicalSMILES as SMILES,\n",
    "    xr.uri as CHEMBL\n",
    "ORDER BY l.ligandName, t.nomenclature\n",
    "\"\"\"\n",
    "\n",
    "cypher_query_aurk = \"\"\"\n",
    "// AURK Inhibitors\n",
    "MATCH (l:Resource)\n",
    "WHERE l.ligandName IN ['AZD1152-HQPA', 'tozasertib', 'SNS-314 mesylate', 'AMG 900', 'ZM-447439', 'ENMD-2076', 'CYC116', 'alisertib', 'PF-03814735', 'CCT129202', 'CCT137690']\n",
    "MATCH path = (l)-[:hasLigand]-(i)-[:hasTarget]-(t)-[:hasTargetFamily]-(tf)\n",
    "    OPTIONAL MATCH (i)-[:hasAction]-(a)\n",
    "    OPTIONAL MATCH (i)-[:hasAffinity]-(af)\n",
    "    OPTIONAL MATCH (i)-[:hasReference]-(r)\n",
    "    OPTIONAL MATCH (l)-[:xref]-(xr)\n",
    "    OPTIONAL MATCH (af)-[:hasUnits]-(afu)\n",
    "RETURN \n",
    "    l.label as Compound,\n",
    "    l.approved as FDA_Approved,\n",
    "    t.label as Target,\n",
    "    tf.label as Target_Family,\n",
    "    a.uri as Action,\n",
    "    af.hasMedianValue as Affinity_Median,\n",
    "    af.hasLowValue as Affinity_Low,\n",
    "    af.hasHighValue as Affinity_High,\n",
    "    afu.uri as Affinity_Units,\n",
    "    r.uri as Reference,\n",
    "    l.comment as Description,\n",
    "    l.inChIKey as InChIKey,\n",
    "    l.canonicalSMILES as SMILES,\n",
    "    xr.uri as CHEMBL\n",
    "ORDER BY l.ligandName, t.nomenclature\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "# Execute the query and display the results\n",
    "results_hdac = run_cypher_query(cypher_query_hdac)\n",
    "results_cdk = run_cypher_query(cypher_query_cdk)\n",
    "results_aurk = run_cypher_query(cypher_query_aurk)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Creating DataFrame for HDAC Data\n",
    "\n",
    "Converts the results of the HDAC inhibitors Cypher query into a Pandas DataFrame for structured data representation and further processing.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Compound</th>\n",
       "      <th>FDA_Approved</th>\n",
       "      <th>Target</th>\n",
       "      <th>Target_Family</th>\n",
       "      <th>Action</th>\n",
       "      <th>Affinity_Median</th>\n",
       "      <th>Affinity_Low</th>\n",
       "      <th>Affinity_High</th>\n",
       "      <th>Affinity_Units</th>\n",
       "      <th>Reference</th>\n",
       "      <th>Description</th>\n",
       "      <th>InChIKey</th>\n",
       "      <th>SMILES</th>\n",
       "      <th>CHEMBL</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>RGFP966</td>\n",
       "      <td>f</td>\n",
       "      <td>histone deacetylase 3</td>\n",
       "      <td>3.5.1.- Histone deacetylases (HDACs)</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>7.10</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/23297220</td>\n",
       "      <td>RGFP966 is a selective inhibitor of histone de...</td>\n",
       "      <td>BLVQHYHDYFTPDV-VCABWLAWSA-N</td>\n",
       "      <td>O=C(Nc1ccc(cc1N)F)C=Cc1cnn(c1)CC=Cc1ccccc1</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>belinostat</td>\n",
       "      <td>t</td>\n",
       "      <td>histone deacetylase 1</td>\n",
       "      <td>3.5.1.- Histone deacetylases (HDACs)</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>7.39</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/17868033</td>\n",
       "      <td>Belinostat is a pan-histone deacetylase (HDAC)...</td>\n",
       "      <td>NCNRHFGMJRPRSK-MDZDMXLPSA-N</td>\n",
       "      <td>ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>belinostat</td>\n",
       "      <td>t</td>\n",
       "      <td>histone deacetylase 1</td>\n",
       "      <td>3.5.1.- Histone deacetylases (HDACs)</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>9.07</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/20139990</td>\n",
       "      <td>Belinostat is a pan-histone deacetylase (HDAC)...</td>\n",
       "      <td>NCNRHFGMJRPRSK-MDZDMXLPSA-N</td>\n",
       "      <td>ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>belinostat</td>\n",
       "      <td>t</td>\n",
       "      <td>histone deacetylase 2</td>\n",
       "      <td>3.5.1.- Histone deacetylases (HDACs)</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>6.90</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/17868033</td>\n",
       "      <td>Belinostat is a pan-histone deacetylase (HDAC)...</td>\n",
       "      <td>NCNRHFGMJRPRSK-MDZDMXLPSA-N</td>\n",
       "      <td>ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>belinostat</td>\n",
       "      <td>t</td>\n",
       "      <td>histone deacetylase 2</td>\n",
       "      <td>3.5.1.- Histone deacetylases (HDACs)</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>9.07</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/20139990</td>\n",
       "      <td>Belinostat is a pan-histone deacetylase (HDAC)...</td>\n",
       "      <td>NCNRHFGMJRPRSK-MDZDMXLPSA-N</td>\n",
       "      <td>ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL4...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     Compound FDA_Approved                 Target  \\\n",
       "0     RGFP966            f  histone deacetylase 3   \n",
       "1  belinostat            t  histone deacetylase 1   \n",
       "2  belinostat            t  histone deacetylase 1   \n",
       "3  belinostat            t  histone deacetylase 2   \n",
       "4  belinostat            t  histone deacetylase 2   \n",
       "\n",
       "                          Target_Family  \\\n",
       "0  3.5.1.- Histone deacetylases (HDACs)   \n",
       "1  3.5.1.- Histone deacetylases (HDACs)   \n",
       "2  3.5.1.- Histone deacetylases (HDACs)   \n",
       "3  3.5.1.- Histone deacetylases (HDACs)   \n",
       "4  3.5.1.- Histone deacetylases (HDACs)   \n",
       "\n",
       "                                              Action  Affinity_Median  \\\n",
       "0  https://rdf.guidetopharmacology.org/ns/gtpo#In...             7.10   \n",
       "1  https://rdf.guidetopharmacology.org/ns/gtpo#In...             7.39   \n",
       "2  https://rdf.guidetopharmacology.org/ns/gtpo#In...             9.07   \n",
       "3  https://rdf.guidetopharmacology.org/ns/gtpo#In...             6.90   \n",
       "4  https://rdf.guidetopharmacology.org/ns/gtpo#In...             9.07   \n",
       "\n",
       "  Affinity_Low Affinity_High  \\\n",
       "0         None          None   \n",
       "1         None          None   \n",
       "2         None          None   \n",
       "3         None          None   \n",
       "4         None          None   \n",
       "\n",
       "                                      Affinity_Units  \\\n",
       "0  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "1  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "2  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "3  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "4  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "\n",
       "                                Reference  \\\n",
       "0  http://identifiers.org/pubmed/23297220   \n",
       "1  http://identifiers.org/pubmed/17868033   \n",
       "2  http://identifiers.org/pubmed/20139990   \n",
       "3  http://identifiers.org/pubmed/17868033   \n",
       "4  http://identifiers.org/pubmed/20139990   \n",
       "\n",
       "                                         Description  \\\n",
       "0  RGFP966 is a selective inhibitor of histone de...   \n",
       "1  Belinostat is a pan-histone deacetylase (HDAC)...   \n",
       "2  Belinostat is a pan-histone deacetylase (HDAC)...   \n",
       "3  Belinostat is a pan-histone deacetylase (HDAC)...   \n",
       "4  Belinostat is a pan-histone deacetylase (HDAC)...   \n",
       "\n",
       "                      InChIKey                                      SMILES  \\\n",
       "0  BLVQHYHDYFTPDV-VCABWLAWSA-N  O=C(Nc1ccc(cc1N)F)C=Cc1cnn(c1)CC=Cc1ccccc1   \n",
       "1  NCNRHFGMJRPRSK-MDZDMXLPSA-N      ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1   \n",
       "2  NCNRHFGMJRPRSK-MDZDMXLPSA-N      ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1   \n",
       "3  NCNRHFGMJRPRSK-MDZDMXLPSA-N      ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1   \n",
       "4  NCNRHFGMJRPRSK-MDZDMXLPSA-N      ONC(=O)C=Cc1cccc(c1)S(=O)(=O)Nc1ccccc1   \n",
       "\n",
       "                                              CHEMBL  \n",
       "0                                               None  \n",
       "1  http://identifiers.org/chembl.compound/CHEMBL4...  \n",
       "2  http://identifiers.org/chembl.compound/CHEMBL4...  \n",
       "3  http://identifiers.org/chembl.compound/CHEMBL4...  \n",
       "4  http://identifiers.org/chembl.compound/CHEMBL4...  "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_hdac = pd.DataFrame(results_hdac)\n",
    "df_hdac.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Creating DataFrame for CDK Data\n",
    "\n",
    "Converts the results of the CDK inhibitors Cypher query into a Pandas DataFrame for structured data representation and further processing.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Compound</th>\n",
       "      <th>FDA_Approved</th>\n",
       "      <th>Target</th>\n",
       "      <th>Target_Family</th>\n",
       "      <th>Action</th>\n",
       "      <th>Affinity_Median</th>\n",
       "      <th>Affinity_Low</th>\n",
       "      <th>Affinity_High</th>\n",
       "      <th>Affinity_Units</th>\n",
       "      <th>Reference</th>\n",
       "      <th>Description</th>\n",
       "      <th>InChIKey</th>\n",
       "      <th>SMILES</th>\n",
       "      <th>CHEMBL</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>7-hydroxystaurosporine</td>\n",
       "      <td>f</td>\n",
       "      <td>3-phosphoinositide dependent protein kinase 1</td>\n",
       "      <td>PDK1 family</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>7.48</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/11896604</td>\n",
       "      <td>7-hydroxystaurosporine is a cell-permeable &lt;Li...</td>\n",
       "      <td>PBCZSGKMGDDXIJ-HQCWYSJUSA-N</td>\n",
       "      <td>CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>7-hydroxystaurosporine</td>\n",
       "      <td>f</td>\n",
       "      <td>LCK proto-oncogene, Src family tyrosine kinase</td>\n",
       "      <td>Src family</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>7.30</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/15486189</td>\n",
       "      <td>7-hydroxystaurosporine is a cell-permeable &lt;Li...</td>\n",
       "      <td>PBCZSGKMGDDXIJ-HQCWYSJUSA-N</td>\n",
       "      <td>CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>7-hydroxystaurosporine</td>\n",
       "      <td>f</td>\n",
       "      <td>checkpoint kinase 1</td>\n",
       "      <td>CHK1 subfamily</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>7.46</td>\n",
       "      <td>8.15</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/10786669</td>\n",
       "      <td>7-hydroxystaurosporine is a cell-permeable &lt;Li...</td>\n",
       "      <td>PBCZSGKMGDDXIJ-HQCWYSJUSA-N</td>\n",
       "      <td>CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>7-hydroxystaurosporine</td>\n",
       "      <td>f</td>\n",
       "      <td>checkpoint kinase 1</td>\n",
       "      <td>CHK1 subfamily</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>7.46</td>\n",
       "      <td>8.15</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/15486189</td>\n",
       "      <td>7-hydroxystaurosporine is a cell-permeable &lt;Li...</td>\n",
       "      <td>PBCZSGKMGDDXIJ-HQCWYSJUSA-N</td>\n",
       "      <td>CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>7-hydroxystaurosporine</td>\n",
       "      <td>f</td>\n",
       "      <td>checkpoint kinase 1</td>\n",
       "      <td>CHK1 subfamily</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>7.46</td>\n",
       "      <td>8.15</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/17292828</td>\n",
       "      <td>7-hydroxystaurosporine is a cell-permeable &lt;Li...</td>\n",
       "      <td>PBCZSGKMGDDXIJ-HQCWYSJUSA-N</td>\n",
       "      <td>CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL1...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Compound FDA_Approved  \\\n",
       "0  7-hydroxystaurosporine            f   \n",
       "1  7-hydroxystaurosporine            f   \n",
       "2  7-hydroxystaurosporine            f   \n",
       "3  7-hydroxystaurosporine            f   \n",
       "4  7-hydroxystaurosporine            f   \n",
       "\n",
       "                                           Target   Target_Family  \\\n",
       "0   3-phosphoinositide dependent protein kinase 1     PDK1 family   \n",
       "1  LCK proto-oncogene, Src family tyrosine kinase      Src family   \n",
       "2                             checkpoint kinase 1  CHK1 subfamily   \n",
       "3                             checkpoint kinase 1  CHK1 subfamily   \n",
       "4                             checkpoint kinase 1  CHK1 subfamily   \n",
       "\n",
       "                                              Action  Affinity_Median  \\\n",
       "0  https://rdf.guidetopharmacology.org/ns/gtpo#In...             7.48   \n",
       "1  https://rdf.guidetopharmacology.org/ns/gtpo#In...             7.30   \n",
       "2  https://rdf.guidetopharmacology.org/ns/gtpo#In...              NaN   \n",
       "3  https://rdf.guidetopharmacology.org/ns/gtpo#In...              NaN   \n",
       "4  https://rdf.guidetopharmacology.org/ns/gtpo#In...              NaN   \n",
       "\n",
       "   Affinity_Low  Affinity_High  \\\n",
       "0           NaN            NaN   \n",
       "1           NaN            NaN   \n",
       "2          7.46           8.15   \n",
       "3          7.46           8.15   \n",
       "4          7.46           8.15   \n",
       "\n",
       "                                      Affinity_Units  \\\n",
       "0  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "1  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "2  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "3  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "4  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "\n",
       "                                Reference  \\\n",
       "0  http://identifiers.org/pubmed/11896604   \n",
       "1  http://identifiers.org/pubmed/15486189   \n",
       "2  http://identifiers.org/pubmed/10786669   \n",
       "3  http://identifiers.org/pubmed/15486189   \n",
       "4  http://identifiers.org/pubmed/17292828   \n",
       "\n",
       "                                         Description  \\\n",
       "0  7-hydroxystaurosporine is a cell-permeable <Li...   \n",
       "1  7-hydroxystaurosporine is a cell-permeable <Li...   \n",
       "2  7-hydroxystaurosporine is a cell-permeable <Li...   \n",
       "3  7-hydroxystaurosporine is a cell-permeable <Li...   \n",
       "4  7-hydroxystaurosporine is a cell-permeable <Li...   \n",
       "\n",
       "                      InChIKey  \\\n",
       "0  PBCZSGKMGDDXIJ-HQCWYSJUSA-N   \n",
       "1  PBCZSGKMGDDXIJ-HQCWYSJUSA-N   \n",
       "2  PBCZSGKMGDDXIJ-HQCWYSJUSA-N   \n",
       "3  PBCZSGKMGDDXIJ-HQCWYSJUSA-N   \n",
       "4  PBCZSGKMGDDXIJ-HQCWYSJUSA-N   \n",
       "\n",
       "                                              SMILES  \\\n",
       "0  CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...   \n",
       "1  CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...   \n",
       "2  CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...   \n",
       "3  CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...   \n",
       "4  CNC1CC2OC(C1OC)(C)n1c3ccccc3c3c1c1n2c2ccccc2c1...   \n",
       "\n",
       "                                              CHEMBL  \n",
       "0  http://identifiers.org/chembl.compound/CHEMBL1...  \n",
       "1  http://identifiers.org/chembl.compound/CHEMBL1...  \n",
       "2  http://identifiers.org/chembl.compound/CHEMBL1...  \n",
       "3  http://identifiers.org/chembl.compound/CHEMBL1...  \n",
       "4  http://identifiers.org/chembl.compound/CHEMBL1...  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_cdk = pd.DataFrame(results_cdk)\n",
    "df_cdk.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Creating DataFrame for AURK Data\n",
    "\n",
    "Converts the results of the AURK inhibitors Cypher query into a Pandas DataFrame for structured data representation and further processing.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Compound</th>\n",
       "      <th>FDA_Approved</th>\n",
       "      <th>Target</th>\n",
       "      <th>Target_Family</th>\n",
       "      <th>Action</th>\n",
       "      <th>Affinity_Median</th>\n",
       "      <th>Affinity_Low</th>\n",
       "      <th>Affinity_High</th>\n",
       "      <th>Affinity_Units</th>\n",
       "      <th>Reference</th>\n",
       "      <th>Description</th>\n",
       "      <th>InChIKey</th>\n",
       "      <th>SMILES</th>\n",
       "      <th>CHEMBL</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ENMD-2076</td>\n",
       "      <td>f</td>\n",
       "      <td>SRC proto-oncogene, non-receptor tyrosine kinase</td>\n",
       "      <td>Src family</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>7.70</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/19320489</td>\n",
       "      <td>ENMD-2076 is an orally-active, Aurora A/angiog...</td>\n",
       "      <td>BLQYVHBZHAISJM-CMDGGOBGSA-N</td>\n",
       "      <td>CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ENMD-2076</td>\n",
       "      <td>f</td>\n",
       "      <td>aurora kinase A</td>\n",
       "      <td>Aurora kinase (Aur) family</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>7.85</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/19320489</td>\n",
       "      <td>ENMD-2076 is an orally-active, Aurora A/angiog...</td>\n",
       "      <td>BLQYVHBZHAISJM-CMDGGOBGSA-N</td>\n",
       "      <td>CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ENMD-2076</td>\n",
       "      <td>f</td>\n",
       "      <td>fms related receptor tyrosine kinase 3</td>\n",
       "      <td>Type III RTKs: PDGFR, CSFR, Kit, FLT3 receptor...</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>8.52</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/19320489</td>\n",
       "      <td>ENMD-2076 is an orally-active, Aurora A/angiog...</td>\n",
       "      <td>BLQYVHBZHAISJM-CMDGGOBGSA-N</td>\n",
       "      <td>CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ENMD-2076</td>\n",
       "      <td>f</td>\n",
       "      <td>kinase insert domain receptor</td>\n",
       "      <td>Type IV RTKs: VEGF (vascular endothelial growt...</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>7.44</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/19320489</td>\n",
       "      <td>ENMD-2076 is an orally-active, Aurora A/angiog...</td>\n",
       "      <td>BLQYVHBZHAISJM-CMDGGOBGSA-N</td>\n",
       "      <td>CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ENMD-2076</td>\n",
       "      <td>f</td>\n",
       "      <td>platelet derived growth factor receptor alpha</td>\n",
       "      <td>Type III RTKs: PDGFR, CSFR, Kit, FLT3 receptor...</td>\n",
       "      <td>https://rdf.guidetopharmacology.org/ns/gtpo#In...</td>\n",
       "      <td>7.25</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "      <td>http://www.bioassayontology.org/bao/bao_comple...</td>\n",
       "      <td>http://identifiers.org/pubmed/19320489</td>\n",
       "      <td>ENMD-2076 is an orally-active, Aurora A/angiog...</td>\n",
       "      <td>BLQYVHBZHAISJM-CMDGGOBGSA-N</td>\n",
       "      <td>CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C</td>\n",
       "      <td>http://identifiers.org/chembl.compound/CHEMBL4...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Compound FDA_Approved                                            Target  \\\n",
       "0  ENMD-2076            f  SRC proto-oncogene, non-receptor tyrosine kinase   \n",
       "1  ENMD-2076            f                                   aurora kinase A   \n",
       "2  ENMD-2076            f            fms related receptor tyrosine kinase 3   \n",
       "3  ENMD-2076            f                     kinase insert domain receptor   \n",
       "4  ENMD-2076            f     platelet derived growth factor receptor alpha   \n",
       "\n",
       "                                       Target_Family  \\\n",
       "0                                         Src family   \n",
       "1                         Aurora kinase (Aur) family   \n",
       "2  Type III RTKs: PDGFR, CSFR, Kit, FLT3 receptor...   \n",
       "3  Type IV RTKs: VEGF (vascular endothelial growt...   \n",
       "4  Type III RTKs: PDGFR, CSFR, Kit, FLT3 receptor...   \n",
       "\n",
       "                                              Action  Affinity_Median  \\\n",
       "0  https://rdf.guidetopharmacology.org/ns/gtpo#In...             7.70   \n",
       "1  https://rdf.guidetopharmacology.org/ns/gtpo#In...             7.85   \n",
       "2  https://rdf.guidetopharmacology.org/ns/gtpo#In...             8.52   \n",
       "3  https://rdf.guidetopharmacology.org/ns/gtpo#In...             7.44   \n",
       "4  https://rdf.guidetopharmacology.org/ns/gtpo#In...             7.25   \n",
       "\n",
       "  Affinity_Low Affinity_High  \\\n",
       "0         None          None   \n",
       "1         None          None   \n",
       "2         None          None   \n",
       "3         None          None   \n",
       "4         None          None   \n",
       "\n",
       "                                      Affinity_Units  \\\n",
       "0  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "1  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "2  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "3  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "4  http://www.bioassayontology.org/bao/bao_comple...   \n",
       "\n",
       "                                Reference  \\\n",
       "0  http://identifiers.org/pubmed/19320489   \n",
       "1  http://identifiers.org/pubmed/19320489   \n",
       "2  http://identifiers.org/pubmed/19320489   \n",
       "3  http://identifiers.org/pubmed/19320489   \n",
       "4  http://identifiers.org/pubmed/19320489   \n",
       "\n",
       "                                         Description  \\\n",
       "0  ENMD-2076 is an orally-active, Aurora A/angiog...   \n",
       "1  ENMD-2076 is an orally-active, Aurora A/angiog...   \n",
       "2  ENMD-2076 is an orally-active, Aurora A/angiog...   \n",
       "3  ENMD-2076 is an orally-active, Aurora A/angiog...   \n",
       "4  ENMD-2076 is an orally-active, Aurora A/angiog...   \n",
       "\n",
       "                      InChIKey  \\\n",
       "0  BLQYVHBZHAISJM-CMDGGOBGSA-N   \n",
       "1  BLQYVHBZHAISJM-CMDGGOBGSA-N   \n",
       "2  BLQYVHBZHAISJM-CMDGGOBGSA-N   \n",
       "3  BLQYVHBZHAISJM-CMDGGOBGSA-N   \n",
       "4  BLQYVHBZHAISJM-CMDGGOBGSA-N   \n",
       "\n",
       "                                             SMILES  \\\n",
       "0  CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C   \n",
       "1  CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C   \n",
       "2  CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C   \n",
       "3  CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C   \n",
       "4  CN1CCN(CC1)c1nc(C=Cc2ccccc2)nc(c1)Nc1n[nH]c(c1)C   \n",
       "\n",
       "                                              CHEMBL  \n",
       "0  http://identifiers.org/chembl.compound/CHEMBL4...  \n",
       "1  http://identifiers.org/chembl.compound/CHEMBL4...  \n",
       "2  http://identifiers.org/chembl.compound/CHEMBL4...  \n",
       "3  http://identifiers.org/chembl.compound/CHEMBL4...  \n",
       "4  http://identifiers.org/chembl.compound/CHEMBL4...  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_aurk = pd.DataFrame(results_aurk)\n",
    "df_aurk.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Exporting DataFrames to Excel Files\n",
    "\n",
    "Exports the processed DataFrames for HDAC, CDK, and AURK inhibitors into separate Excel files. This allows external analysis or sharing of the data.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "# export each DataFrame to a xlsx file\n",
    "df_hdac.to_excel(f\"{INTERIM_DIR}/gtp_hdac_inhibitors_data.xlsx\", index=False)\n",
    "df_cdk.to_excel(f\"{INTERIM_DIR}/gtp_cdk_inhibitors_data.xlsx\", index=False)\n",
    "df_aurk.to_excel(f\"{INTERIM_DIR}/gtp_aurk_inhibitors_data.xlsx\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "YRjw24yMavka"
   },
   "source": [
    "## Citation\n",
    "\n",
    "**BibTeX:**\n",
    "\n",
    "```\n",
    "@article{10.1093/nar/gkad944,\n",
    "    author = {Harding, Simon D and Armstrong, Jane F and Faccenda, Elena and Southan, Christopher and Alexander, StephenP H and Davenport, Anthony P and Spedding, Michael and Davies, Jamie A},\n",
    "    title = \"{The IUPHAR/BPS Guide to PHARMACOLOGY in 2024}\",\n",
    "    journal = {Nucleic Acids Research},\n",
    "    volume = {52},\n",
    "    number = {D1},\n",
    "    pages = {D1438-D1449},\n",
    "    year = {2023},\n",
    "    month = {10},\n",
    "    abstract = \"{The IUPHAR/BPS Guide to PHARMACOLOGY (GtoPdb; https://www.guidetopharmacology.org) is an open-access, expert-curated, online database that provides succinct overviews and key references for pharmacological targets and their recommended experimental ligands. It includes over 3039 protein targets and 12163 ligand molecules, including approved drugs, small molecules, peptidesand antibodies. Here, we report recent developments to the resource and describe expansion in content over the six database releases made during the last two years. The database update section of this paper focuses on two areas relating to important global health challenges. The first, SARS-CoV-2 COVID-19, remains a major concern and we describe our efforts to expand the database to include a new family of coronavirus proteins. The second area is antimicrobial resistance, for which we have extended our coverage of antibacterials in partnership with AntibioticDB, a collaboration that has continued through support from GARDP. We discuss other areas of curation and also focus on our external links to resources such as PubChem that bring important synergies to the resources.}\",\n",
    "    issn = {0305-1048},\n",
    "    doi = {10.1093/nar/gkad944},\n",
    "    url = {https://doi.org/10.1093/nar/gkad944},\n",
    "    eprint = {https://academic.oup.com/nar/article-pdf/52/D1/D1438/55039511/gkad944.pdf},\n",
    "}\n",
    "```"
   ]
  }
 ],
 "metadata": {
  "colab": {
   "name": "gtpd_init.ipynb",
   "provenance": []
  },
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
